org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** DONE On Veganism                                     :veganism:@Thoughts:
CLOSED: [2020-12-28 Mon 12:06]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: on-veganism
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-12-28 Mon 10:56]--[2020-12-28 Mon 11:32] =>  0:36
:END:

*** Overview 
After being vegetarian for about a year, I went vegan in the Fall of 2020. A friend challenged me to do it for 2 weeks, and then I never stopped. It's been great. I'll come back and elaborate more on my thinking and experiences, but for now here are some of my favorite resources relating to veganism:
- [[https://zenhabits.net/vegan/][A Call for Compassion for the Defenseless]]
- [[https://zenhabits.net/vegan-guide/][A Loving Guide to Going Vegan]]
- [[https://www.utilitarian.net/singer/by/1979----.htm][Peter Singer, "Equality for Animals?"]]
