content/posts/on-veganism/index.md
+++
title = "On Veganism"
date = 2020-12-28T12:06:00-05:00
tags = ["veganism"]
categories = ["Thoughts"]
draft = false
+++

# Overview {#overview}

After being vegetarian for about a year, I went vegan in the Fall of 2020. A friend challenged me to do it for 2 weeks, and then I never stopped. It's been great. I'll come back and elaborate more on my thinking and experiences, but for now here are some of my favorite resources relating to veganism:

-   [A Call for Compassion for the Defenseless](https://zenhabits.net/vegan/)
-   [A Loving Guide to Going Vegan](https://zenhabits.net/vegan-guide/)
-   [Peter Singer, "Equality for Animals?"](https://www.utilitarian.net/singer/by/1979----.htm)
